In [2]:
import pandas as pd
import numpy as np

In [3]:
rng = np.random.default_rng(42)
ser = pd.Series(rng.integers(0, 10, 4))
ser

0    0
1    7
2    6
3    4
dtype: int64

In [6]:
df = pd.DataFrame(rng.integers(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  5  1  8  4
1  5  3  1  9
2  7  6  4  8

In [7]:
np.exp(ser)

0       1.000000
1    1096.633158
2     403.428793
3      54.598150
dtype: float64

In [8]:
np.sin(df * np.pi / 4)

          A         B             C             D
0 -0.707107  0.707107 -2.449294e-16  1.224647e-16
1 -0.707107  0.707107  7.071068e-01  7.071068e-01
2 -0.707107 -1.000000  1.224647e-16 -2.449294e-16

In [11]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 39538223, 'Texas': 29145505,
                 'Florida': 21538187}, name='population')

In [12]:
population / area

Alaska              NaN
California    93.257784
Florida             NaN
Texas         41.896072
dtype: float64

In [14]:
area.index.union(population.index)

Index(['Alaska', 'California', 'Florida', 'Texas'], dtype='object')

In [15]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [16]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [24]:
A = pd.DataFrame(rng.integers(0, 20, (2, 2)),
                 columns=['a', 'b'])
A

    a  b
0   9  0
1  10  3

In [25]:
B = pd.DataFrame(rng.integers(0, 10, (3, 3)),
                 columns=['b', 'a', 'c'])
B

   b  a  c
0  7  6  9
1  7  3  9
2  4  3  9

In [26]:
A + B

      a     b   c
0  15.0   7.0 NaN
1  13.0  10.0 NaN
2   NaN   NaN NaN

In [27]:
A.add(B, fill_value=A.values.mean())

      a     b     c
0  15.0   7.0  14.5
1  13.0  10.0  14.5
2   8.5   9.5  14.5

In [37]:
A.pow(B, fill_value=A.values.mean())

            a          b             c
0  531441.000     0.0000  4.605367e+06
1    1000.000  2187.0000  4.605367e+06
2     166.375   915.0625  4.605367e+06

In [39]:
A = rng.integers(10, size=(3, 4))
A

array([[6, 9, 4, 1],
       [8, 6, 7, 0],
       [3, 7, 8, 4]])

In [44]:
A - A[0]
# the whole A matrix - [6, 9, 4, 1]
# A[0] series will be broadcasted for 3 rows, 4 columns A.
# Each row of broadcasted form of A[0] is the series form of A[0]

array([[ 0,  0,  0,  0],
       [ 2, -3,  3, -1],
       [-3, -2,  4,  3]])

In [45]:
df = pd.DataFrame(A, columns=['Q', 'R', 'S', 'T'])
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1  2 -3  3 -1
2 -3 -2  4  3

In [46]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -3  0 -5 -8
1  2  0  1 -6
2 -4  0  1 -3

In [47]:
halfrow = df.iloc[0, ::2]
halfrow

Q    6
S    4
Name: 0, dtype: int64

In [48]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1  2.0 NaN  3.0 NaN
2 -3.0 NaN  4.0 NaN